<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"3b26e3ea6feb807b08d489e4d74836d46668eeea93d079794d1bb6499c5c4ded","plan_job_ref":"Job Terraform Plan #659 at https://github.com/cal-itp/data-infra/actions/runs/19210122817","plan_out_hash":"da5fddbefa87f2cb062f5f02e0b03ea2c895f2db6a02efff04bd636183a1e8e7","plan_hash":"cda3b865bc769f6b587aff7d1149351bbbfd4b66f07626585f93ef6dc0074d77","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/iam/us__
<details>
<summary>Plan: 3 to add, 0 to change, 8 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # google_project_iam_member.metabase-service-account["roles/cloudsql.client"] will be created
+   resource "google_project_iam_member" "metabase-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:metabase-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra-staging"
+       role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.metabase-service-account["roles/secretmanager.secretAccessor"] will be created
+   resource "google_project_iam_member" "metabase-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:metabase-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra-staging"
+       role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_iam_member.workflow-service-account["roles/bigquery.dataViewer"] will be destroyed
  # (because google_project_iam_member.workflow-service-account is not in configuration)
-   resource "google_project_iam_member" "workflow-service-account" {
-       etag    = "BwZDIBCiIrk=" -> null
-       id      = "cal-itp-data-infra-staging/roles/bigquery.dataViewer/serviceAccount:workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       member  = "serviceAccount:workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       project = "cal-itp-data-infra-staging" -> null
-       role    = "roles/bigquery.dataViewer" -> null
    }

  # google_project_iam_member.workflow-service-account["roles/bigquery.jobUser"] will be destroyed
  # (because google_project_iam_member.workflow-service-account is not in configuration)
-   resource "google_project_iam_member" "workflow-service-account" {
-       etag    = "BwZDIBCiIrk=" -> null
-       id      = "cal-itp-data-infra-staging/roles/bigquery.jobUser/serviceAccount:workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       member  = "serviceAccount:workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       project = "cal-itp-data-infra-staging" -> null
-       role    = "roles/bigquery.jobUser" -> null
    }

  # google_project_iam_member.workflow-service-account["roles/iam.serviceAccountTokenCreator"] will be destroyed
  # (because google_project_iam_member.workflow-service-account is not in configuration)
-   resource "google_project_iam_member" "workflow-service-account" {
-       etag    = "BwZDIBCiIrk=" -> null
-       id      = "cal-itp-data-infra-staging/roles/iam.serviceAccountTokenCreator/serviceAccount:workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       member  = "serviceAccount:workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       project = "cal-itp-data-infra-staging" -> null
-       role    = "roles/iam.serviceAccountTokenCreator" -> null
    }

  # google_project_iam_member.workflow-service-account["roles/pubsub.publisher"] will be destroyed
  # (because google_project_iam_member.workflow-service-account is not in configuration)
-   resource "google_project_iam_member" "workflow-service-account" {
-       etag    = "BwZDIBCiIrk=" -> null
-       id      = "cal-itp-data-infra-staging/roles/pubsub.publisher/serviceAccount:workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       member  = "serviceAccount:workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       project = "cal-itp-data-infra-staging" -> null
-       role    = "roles/pubsub.publisher" -> null
    }

  # google_project_iam_member.workflow-service-account["roles/secretmanager.secretAccessor"] will be destroyed
  # (because google_project_iam_member.workflow-service-account is not in configuration)
-   resource "google_project_iam_member" "workflow-service-account" {
-       etag    = "BwZDIBCiIrk=" -> null
-       id      = "cal-itp-data-infra-staging/roles/secretmanager.secretAccessor/serviceAccount:workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       member  = "serviceAccount:workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       project = "cal-itp-data-infra-staging" -> null
-       role    = "roles/secretmanager.secretAccessor" -> null
    }

  # google_project_iam_member.workflow-service-account["roles/storage.objectUser"] will be destroyed
  # (because google_project_iam_member.workflow-service-account is not in configuration)
-   resource "google_project_iam_member" "workflow-service-account" {
-       etag    = "BwZDIBCiIrk=" -> null
-       id      = "cal-itp-data-infra-staging/roles/storage.objectUser/serviceAccount:workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       member  = "serviceAccount:workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       project = "cal-itp-data-infra-staging" -> null
-       role    = "roles/storage.objectUser" -> null
    }

  # google_project_iam_member.workflow-service-account["roles/workflows.invoker"] will be destroyed
  # (because google_project_iam_member.workflow-service-account is not in configuration)
-   resource "google_project_iam_member" "workflow-service-account" {
-       etag    = "BwZDIBCiIrk=" -> null
-       id      = "cal-itp-data-infra-staging/roles/workflows.invoker/serviceAccount:workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       member  = "serviceAccount:workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       project = "cal-itp-data-infra-staging" -> null
-       role    = "roles/workflows.invoker" -> null
    }

  # google_service_account.metabase-service-account will be created
+   resource "google_service_account" "metabase-service-account" {
+       account_id   = "************************"
+       description  = "Service account for Metabase"
+       disabled     = false
+       display_name = "metabase"
+       email        = "metabase-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com"
+       id           = (known after apply)
+       member       = "serviceAccount:metabase-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com"
+       name         = (known after apply)
+       project      = "cal-itp-data-infra-staging"
+       unique_id    = (known after apply)
    }

  # google_service_account.workflow-service-account will be destroyed
  # (because google_service_account.workflow-service-account is not in configuration)
-   resource "google_service_account" "workflow-service-account" {
-       account_id   = "workflow-service-account" -> null
-       description  = "Service account for Workflow" -> null
-       disabled     = false -> null
-       display_name = "workflow" -> null
-       email        = "workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       id           = "projects/cal-itp-data-infra-staging/serviceAccounts/workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       member       = "serviceAccount:workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       name         = "projects/cal-itp-data-infra-staging/serviceAccounts/workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       project      = "cal-itp-data-infra-staging" -> null
-       unique_id    = "100174816115827528420" -> null
    }

Plan: 3 to add, 0 to change, 8 to destroy.

Changes to Outputs:
+   google_service_account_metabase-service-account_email                                                                                                                                                = "metabase-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com"
+   google_service_account_metabase-service-account_id                                                                                                                                                   = (known after apply)
+   google_service_account_metabase-service-account_name                                                                                                                                                 = (known after apply)
-   google_service_account_workflow-service-account_email                                                                                                                                                = "workflow-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
```
</details>

:memo: Plan generated in [Terraform Plan #659](https://github.com/cal-itp/data-infra/actions/runs/19210122817)